__author__ = 'Руссол Максим Александрович.'

# Задача-1: Ввести ваше имя и возраст в отдельные переменные,
# вычесть из возраста 18 и вывести на экран в следующем виде:
# "Василий на 2 года/лет больше 18"
# по желанию сделать адаптивный вывод, то есть "на 5 лет больше", "на 3 года меньше" и.т.д.

# TODO:
name = "Максим"
age = 29
age -= 18
age = str(age)
print(name , " на ", age, " лет больше 18 ")
