print("Hello World")

print(2**2)

Hello_World='2*3'

a = 9
a += 1
print(a**3)
#переменная типа - float
f=1/3
print(type(f))

#название типов данных'''
first="age "
second=" 29"
second=str(second)
print(first+second)

#primer 1
a=1.3
b=36
c=a+b
print(c)
#primer 2
s=float(3.8)+6
print(s)

'''ввод/вывод данных'''
#name = input("Enter your name: ")
#print("Hello world " + name)

#ввод/вывод данных 2'''
'''name = input("Enter integer: ")
name = int(name)
print(name)
print(type(name))#'''

age = 18
name = "Vasya"
print("My name is", name, ".I'm", age, "years old.")

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

# TODO: код пишем тут...