# Задание-1:
# Реализуйте описаную ниже задачу, используя парадигмы ООП:
# В школе есть Классы(5А, 7Б и т.д.), в которых учатся Ученики.
# У каждого ученика есть два Родителя(мама и папа).
# Также в школе преподают Учителя. Один учитель может преподавать
# в неограниченном кол-ве классов свой определенный предмет.
# Т.е. Учитель Иванов может преподавать математику у 5А и 6Б,
# но больше математику не может преподавать никто другой.

# Выбранная и заполненная данными структура должна решать следующие задачи:
# 1. Получить полный список всех классов школы
# 2. Получить список всех учеников в указанном классе
#  (каждый ученик отображается в формате "Фамилия И.О.")
# 3. Получить список всех предметов указанного ученика
#  (Ученик --> Класс --> Учителя --> Предметы)
# 4. Узнать ФИО родителей указанного ученика
# 5. Получить список всех Учителей, преподающих в указанном классе
class Person:
    def __init__(self, name, surname, f_name):
        self.name = name
        self.surname = surname
        self.f_name = f_name


class Student(Person):
    def __init__(self, name, surname, f_name, class_group, mom, dad):
        Person.__init__(self, name, surname, f_name)
        self.class_group = class_group
        # {'class_n': int(class_group.split()[0]),
        #  'class_c': class_group.split()[2]}
        self._mom = mom
        self._dad = dad

    def get_full_name(self):
        return "{} {} {}".format(self.name, self.surname, self.f_name)

    def full_name_format(self):
        return "{} {}. {}.".format(self.name, self.surname[0], self.f_name[0])


class Teacher(Person):
    def __init__(self, name, surname, f_name, subject_name):
        Person.__init__(self, name, surname, f_name)
        self.subject_name = subject_name


class School:
    def __init__(self, classes, subjects):
        self.classes = classes
        self.subjects = subjects


dad = ['Голубов Геннадий Андреевич',
       'Буданов Степан Адрианович',
       'Мальчиков Руслан Геннадиевич',
       'Попов Модест Прокофиевич',
       'Рагозин Филимон Фролович',
       'Шверник Семен Тимурович',
       'Буров Елисей Сигизмундович',
       'Дуванов Денис Тарасович',
       'Ювелев Емельян Севастьянович',
       'Кручинин Роман Архипович',
       'Задорнов Лавр Фролович',
       'Якунькин Харитон Аникитевич',
       'Евремович Артур Валерьянович',
       'Скоробогатов Зиновий Онисимович',
       'Зарубин Захар Дмитриевич',
       'Паршиков Игорь Федотович',
       'Новосельцев Фока Андреевич',
       'Квартин Феликс Эрнестович',
       'Грибанов Дмитрий Александрович',
       'Николаенко Кузьма Зиновиевич']

mom = ['Голубова Арина Василиевна',
       'Буданова Евгения Игоревна',
       'Мальчикова Виктория Юлиевна',
       'Попова Пелагея Афанасиевна',
       'Рагозина Инга Захаровна',
       'Шверник Любава Филипповна',
       'Бурова Василиса Никитевна',
       'Дуванова Фаина Ипполитовна',
       'Ювелева Рада Святославовна',
       'Кручинина Валерия Георгиевна',
       'Задорнова Пелагея Алексеевна',
       'Якунькина Лариса Алексеевна',
       'Евремович Валентина Серафимовна',
       'Скоробогатова Кристина Тимуровна',
       'Зарубина Нина Фомевна',
       'Паршикова Влада Елизаровна',
       'Новосельцев Розалия Яновна',
       'Квартин Доминика Михеевна',
       'Грибанов Наталья Романовна',
       'Николаенко Анисья Трофимовна']

subject = ['История',
           'Русский язык',
           'Математика',
           'Иностранные языки',
           'Информатика',
           'Трудовое воспитание',
           'Физика',
           'Химия',
           'Биология',
           'Физкультура',
           'Социология',
           'Экономика',
           'Политология',
           'География']

Students = [Student('Голубова', 'Дина', 'Геннадиевна', '11 А', dad[0], mom[0], ),
            Student('Буданова', 'Агафья', 'Степановна', '11 Б', dad[1], mom[1], ),
            Student('Мальчиков', 'Лука', 'Руслан', '11 А', dad[2], mom[2], ),
            Student('Попов', 'Фома', 'Модестович', '11 Б', dad[3], mom[3], ),
            Student('Рагозин', 'Герман', 'Филимонович', '11 А', dad[4], mom[4], ),
            Student('Шверник', 'Адам', 'Семенович', '11 Б', dad[5], mom[5], ),
            Student('Буров', 'Никифор', 'Елисеевич', '11 А', dad[6], mom[6], ),
            Student('Дуванова', 'Инга', 'Денисовна', '11 Б', dad[7], mom[7], ),
            Student('Ювелев', 'Мир', 'Емельянович', '11 А', dad[8], mom[8], ),
            Student('Кручинин', 'Иннокентий', 'Романович', '11 Б', dad[9], mom[9], ),
            Student('Задорнов', 'Моисей', 'Лаврович', '11 А', dad[10], mom[10], ),
            Student('Якунькин', 'Наум', 'Харитонович', '11 Б', dad[11], mom[11], ),
            Student('Евремович', 'Фома', 'Артурович', '11 А', dad[12], mom[12], ),
            Student('Скоробогатов', 'Петр', 'Зиновиевич', '11 Б', dad[13], mom[13], ),
            Student('Зарубина', 'Бронислава', 'Захарович', '11 А', dad[14], mom[14], ),
            Student('Паршиков', 'Платон', 'Игорьевич', '11 Б', dad[15], mom[15], ),
            Student('Новосельцев', 'Пимен', 'Фокаевич', '11 А', dad[16], mom[16], ),
            Student('Квартин', 'Осип', 'Феликсович', '11 Б', dad[17], mom[17], ),
            Student('Грибанов', 'Артемий', 'Дмитриевич', '11 А', dad[18], mom[18], ),
            Student('Николаенко', 'Евдоким', 'Кузьмич', '11 Б', dad[19], mom[19], ), ]

Teachers = [Teacher('Торсунов', 'Никон', 'Егорович', ''),
            Teacher('Квакина', 'Марфа', 'Семеновна', ''),
            Teacher('Юганцева', 'Анастасия', 'Елизаровна', ''),
            Teacher('Шатова', 'Тамара', 'Ростиславовна', ''),
            Teacher('Нырцева', 'Альбина', 'Святославовна', ''),
            Teacher('Ярополов', 'Аскольд', 'Наумович', ''),
            Teacher('Борхеса', 'Юлия', 'Якововна', ''),
            Teacher('Лазарева', 'Ирина', 'Мироновна', ''),
            Teacher('Лившиц', 'Богдан', 'Феликсович', ''),
            Teacher('Сарычев', 'Эдуард', 'Прохорович', ''),
            Teacher('Грекова', 'Римма', 'Степановна', ''),
            Teacher('Кручинин', 'Мир', 'Святославович', ''),
            Teacher('Пищикова', 'Арина', 'Семеновна', ''),
            Teacher('Малец', 'Авдей', 'Михаилович', ''),]

# s = Students[1]
# print(Student.get_full_name(Students[1]))
# print(Student.full_name_format(Students[2]))









# for Student in Students:
#     for i,j in Student:
#         i[4] = dad []
#     def __init__(self, group_classes, subjects, teachers, students):
#         self.group_classes = group_classes
#         self.subjects = subjects
#         self.teachers = teachers
#         self.students = students


#
# print(Student.same_group_class('11 В'))

#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','',''),
#             Student('','','','','','')]


